tsung_offtherails.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/opt/homebrew/Cellar/tsung/1.7.0/share/tsung/tsung-1.0.dtd">

<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true" />
  </clients>

  <servers>
    <!--TODO: replace cs291.com with eb url-->
    <server host="localhost" port="3000" type="ssl"></server>
  </servers>
  
  <!-- <load>
    <arrivalphase phase="1" duration="5" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="10" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
  </load> -->
  <load>
    <arrivalphase phase="1" duration="1" unit="minute">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="1" unit="minute">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="1" unit="minute">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="1" unit="minute">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="1" unit="minute">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="6" duration="1" unit="minute">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="7" duration="1" unit="minute">
      <users arrivalrate="64" unit="second"></users>
    </arrivalphase>
    <!-- <arrivalphase phase="8" duration="1" unit="second">
      <users arrivalrate="128" unit="second"></users>
    </arrivalphase> -->
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>
  </options>

  <sessions>
    <!--This session simulates a logged-in user browsing through the items on the homepage.-->
    <session name="scenario_1" type="ts_http" weight="1">
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="rand_n" />
      </setdynvars>
      <request><http method="GET" url="/"></http></request>
      <request subst="true"><http method="POST" url="/login/" contents='{"first_name":"","last_name":"","email":"e%%_rand_n%%@mail.com","password":"pw","password_confirmation":""}'></http></request>
      <request><http method="GET" url="/"></http></request>
      <thinktime value="3" random="true"></thinktime>
      <request><http method="POST" url="/logout/"></http></request>
    </session>

    <!--This session simulates a non-logged in user browsing through items on the homepage.-->
    <!-- <session name="scenario_2" type="ts_http" weight="1">
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="rand_n1" />
      </setdynvars>
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="rand_n2" />
      </setdynvars>
      <request><http method="GET" url="/"></http></request>
      <request subst="true"><http method="GET" url="/items/%%_rand_n1%%/"></http></request>
      <thinktime value="3" random="true"></thinktime>
      <request><http method="GET" url="/"></http></request>
      <request subst="true"><http method="GET" url="/items/%%_rand_n2%%/"></http></request>
      <thinktime value="3" random="true"></thinktime>
    </session>

    <!--This session simulates an authenticated user viewing and purchasing one item, then looking at their purchase history.-->
    <session name="scenario_3" type="ts_http" weight="1">
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="rand_n1" />
      </setdynvars>
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="rand_n2" />
      </setdynvars>

      <request><http method="GET" url="/"></http></request>
      <request subst="true"><http method="POST" url="/login/" contents='{"first_name":"","last_name":"","email":"e%%_rand_n1%%@mail.com","password":"pw","password_confirmation":""}'></http></request>
      <request><http method="GET" url="/"></http></request>
      <thinktime value="3" random="true"></thinktime>
      <request subst="true"><http method="GET" url="/items/%%_rand_n2%%/"></http></request>
      <!-- TODO: purchase the item -->
      <request subst="true"><http method="GET" url="/current_order?user_id=%%_rand_n1%%"></http></request>
      <!-- TODO: Creates new order with order id of current order-->
      <request subst="true"><http method="POST" url="/order_items/" contents='{"order_item":{"quantity":1,"order_id":%%sub for whatever returned by previous get call%%,"item_id":"%%_rand_n2%%"}}'></http></request>
      <request subst="true"><http method="PATCH" url="/orders/%%extract%%/" contents='{"user_id":%%_rand_n1%%,"purchased":true}'></http></request>
      <thinktime value="3" random="true"></thinktime>
      <!-- TODO: view purchase history -->
      <request subst="true"><http method="GET" url="/order_items?order_id=%%_rand_n1%%"></http></request>
      <!-- logout -->
      <thinktime value="3" random="true"></thinktime>
      <request><http method="POST" url="/logout/"></http></request>
    </session>

    <!-- This session simulates an authenticated user creating, updating, and deleting a new item listing.-->
    <session name="scenario_4" type="ts_http" weight="1">
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="rand_n1" />
      </setdynvars>
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="rand_n2" />
      </setdynvars>
      <request><http method="GET" url="/"></http></request>
      <request subst="true"><http method="POST" url="/login/" contents='{"first_name":"","last_name":"","email":"e%%_rand_n1%%@mail.com","password":"pw","password_confirmation":""}'></http></request>
      <request><http method="POST" url="/items/" contents='{"name":"a","price":"1","quantity":"1","show":"","image_link":"bleh"}'></http></request>
      <thinktime value="3" random="true"></thinktime>
      <request subst="true"><http method="PATCH" url="/items/%%_rand_n1%%/" contents='{"name":"b","price":"1","quantity":"1","show":"","image_link":"bleh"}'></http></request>
      <thinktime value="3" random="true"></thinktime>
      <request subst="true"><http method="DELETE" url="/items/%%_rand_n1%%/"></http></request>
      <request><http method="POST" url="/logout/"></http></request>
    </session>

    <!--This session simulates an authenticated user leaving a review, editing their review, then deleting it.-->
    <session name="scenario_5" type="ts_http" weight="1">
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="rand_n1" />
      </setdynvars>
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="rand_n2" />
      </setdynvars>
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="rand_n3" />
      </setdynvars>
      <request><http method="GET" url="/"></http></request>
      <request subst="true"><http method="POST" url="/login/" contents='{"first_name":"","last_name":"","email":"e%%_rand_n1%%@mail.com","password":"pw","password_confirmation":""}'></http></request>
      <request><http method="GET" url="/"></http></request>
      <request subst="true"><http method="GET" url="/items/%%_rand_n2%%/"></http></request>
      <request><http method="POST" url="/ratings/" contents='{"comment":"", "score":"5", "item_id":"%%_rand_n2%%", "user_id":"%%_rand_n1%%"}'</http></request>
      <thinktime value="3" random="true"></thinktime>
      <request subst="true"><http method="PATCH" url="/ratings/%%_rand_n3%%/" contents='{"comment":"", "score":"3", "item_id":"%%_rand_n2%%", "user_id":"%%_rand_n1%%"}'></http></request>
      <thinktime value="3" random="true"></thinktime>
      <request subst="true"><http method="DELETE" url="/ratings/%%_rand_n3%%/"></http></request>
      <request><http method="POST" url="/logout/"></http></request>
    </session> -->
  </sessions>
</tsung>